In [1]:
import pandas as pd

# Create Data Frame

In [2]:
# 10-01-11
# dept-position-number

# series
emp_id = [100111,100112,200210,200211,200312,300207]
emp_name = [
    'Raven Bierman',
    'Valter Havers',
    'Marko Mendell',
    'Takahiro Momota',
    'Yahiko Tilemans',
    'Dina Rebaine'
]
gender = ['Female','Male','Male','Male','Male','Female']
hire_date = [
    '2016-12-04',
    '2018-04-13',
    '2018-07-04',
    '2016-11-18',
    '2017-05-26',
    '2015-03-20'
]
salary = [7000000,7000000,15000000,12000000,20000000,15000000]

# dictionary
dict_emp = {
    'name':emp_name,
    'gender':gender,
    'hire date':hire_date,
    'gross salary':salary
}

# dataframe
df = pd.DataFrame(dict_emp, index = emp_id)

In [3]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

# Selection

> column selection

In [4]:
df['name']

100111      Raven Bierman
100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
300207       Dina Rebaine
Name: name, dtype: object

In [5]:
df.name

100111      Raven Bierman
100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
300207       Dina Rebaine
Name: name, dtype: object

In [6]:
df[['name','gross salary']]

                   name  gross salary
100111    Raven Bierman       7000000
100112    Valter Havers       7000000
200210    Marko Mendell      15000000
200211  Takahiro Momota      12000000
200312  Yahiko Tilemans      20000000
300207     Dina Rebaine      15000000

In [7]:
select_var = ['name','gender','gross salary']

df[select_var]

                   name  gender  gross salary
100111    Raven Bierman  Female       7000000
100112    Valter Havers    Male       7000000
200210    Marko Mendell    Male      15000000
200211  Takahiro Momota    Male      12000000
200312  Yahiko Tilemans    Male      20000000
300207     Dina Rebaine  Female      15000000

In [8]:
df.loc[:,select_var]

                   name  gender  gross salary
100111    Raven Bierman  Female       7000000
100112    Valter Havers    Male       7000000
200210    Marko Mendell    Male      15000000
200211  Takahiro Momota    Male      12000000
200312  Yahiko Tilemans    Male      20000000
300207     Dina Rebaine  Female      15000000

In [9]:
df.iloc[:,0]

100111      Raven Bierman
100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
300207       Dina Rebaine
Name: name, dtype: object

In [10]:
df.iloc[:,[0,2]]

                   name   hire date
100111    Raven Bierman  2016-12-04
100112    Valter Havers  2018-04-13
200210    Marko Mendell  2018-07-04
200211  Takahiro Momota  2016-11-18
200312  Yahiko Tilemans  2017-05-26
300207     Dina Rebaine  2015-03-20

> row selection

In [11]:
df[0:1]

                 name  gender   hire date  gross salary
100111  Raven Bierman  Female  2016-12-04       7000000

In [12]:
df[1:4]

                   name gender   hire date  gross salary
100112    Valter Havers   Male  2018-04-13       7000000
200210    Marko Mendell   Male  2018-07-04      15000000
200211  Takahiro Momota   Male  2016-11-18      12000000

In [13]:
df.loc[[100112,200211],:]

                   name gender   hire date  gross salary
100112    Valter Havers   Male  2018-04-13       7000000
200211  Takahiro Momota   Male  2016-11-18      12000000

In [14]:
df.iloc[[1,4],:]

                   name gender   hire date  gross salary
100112    Valter Havers   Male  2018-04-13       7000000
200312  Yahiko Tilemans   Male  2017-05-26      20000000

> combine row and column selection

In [15]:
df.loc[100112,'name']

'Valter Havers'

In [16]:
df.iloc[1,0]

'Valter Havers'

In [17]:
df.loc[[100112,200210],['name','gender','hire date']]

                 name gender   hire date
100112  Valter Havers   Male  2018-04-13
200210  Marko Mendell   Male  2018-07-04

In [18]:
df.iloc[1:3,0:3]

                 name gender   hire date
100112  Valter Havers   Male  2018-04-13
200210  Marko Mendell   Male  2018-07-04

> conditional selection

In [19]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [20]:
df['name'] == 'Raven Bierman'

100111     True
100112    False
200210    False
200211    False
200312    False
300207    False
Name: name, dtype: bool

In [21]:
df['gender'] == 'Male'

100111    False
100112     True
200210     True
200211     True
200312     True
300207    False
Name: gender, dtype: bool

In [22]:
df[df['name'] == 'Raven Bierman']

                 name  gender   hire date  gross salary
100111  Raven Bierman  Female  2016-12-04       7000000

In [23]:
df[df['gender'] == 'Male']

                   name gender   hire date  gross salary
100112    Valter Havers   Male  2018-04-13       7000000
200210    Marko Mendell   Male  2018-07-04      15000000
200211  Takahiro Momota   Male  2016-11-18      12000000
200312  Yahiko Tilemans   Male  2017-05-26      20000000

In [24]:
df[df['gender'] == 'Female']

                 name  gender   hire date  gross salary
100111  Raven Bierman  Female  2016-12-04       7000000
300207   Dina Rebaine  Female  2015-03-20      15000000

In [25]:
df[(df['gender'] == 'Male')&(df['gross salary']>10000000)]

                   name gender   hire date  gross salary
200210    Marko Mendell   Male  2018-07-04      15000000
200211  Takahiro Momota   Male  2016-11-18      12000000
200312  Yahiko Tilemans   Male  2017-05-26      20000000

In [26]:
df[(df['gender'] == 'Male')&(df['gross salary']>10000000)]['name']

200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
Name: name, dtype: object

# Addition

In [27]:
df_edit = df.copy()

> adding rows

In [28]:
# series
emp_no = [200115,100214]
emp_name = [
    'Alicia Stark',
    'John Norton',

]
gender = ['Female','Male']
hire_date = [
    '2020-05-29',
    '2020-05-29'
]
salary = [7000000,12000000]

# dictionary
dict_emp = {
    'name':emp_name,
    'gender':gender,
    'hire date':hire_date,
    'gross salary':salary
}

df_new = pd.DataFrame(dict_emp)
df_new.index = emp_no

In [29]:
df_edit = df_edit.append(df_new)
df_edit

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000
200115     Alicia Stark  Female  2020-05-29       7000000
100214      John Norton    Male  2020-05-29      12000000

> adding columns

In [30]:
df_edit['nett salary'] = df_edit['gross salary'] - df_edit['gross salary']*0.10

In [31]:
df_edit

                   name  gender   hire date  gross salary  nett salary
100111    Raven Bierman  Female  2016-12-04       7000000    6300000.0
100112    Valter Havers    Male  2018-04-13       7000000    6300000.0
200210    Marko Mendell    Male  2018-07-04      15000000   13500000.0
200211  Takahiro Momota    Male  2016-11-18      12000000   10800000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000   18000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000   13500000.0
200115     Alicia Stark  Female  2020-05-29       7000000    6300000.0
100214      John Norton    Male  2020-05-29      12000000   10800000.0

# Deletion

> remove columns

In [32]:
df_edit.drop('nett salary', axis = 1)

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000
200115     Alicia Stark  Female  2020-05-29       7000000
100214      John Norton    Male  2020-05-29      12000000

In [33]:
df_edit.drop(['hire date','gender'], axis = 1)

                   name  gross salary  nett salary
100111    Raven Bierman       7000000    6300000.0
100112    Valter Havers       7000000    6300000.0
200210    Marko Mendell      15000000   13500000.0
200211  Takahiro Momota      12000000   10800000.0
200312  Yahiko Tilemans      20000000   18000000.0
300207     Dina Rebaine      15000000   13500000.0
200115     Alicia Stark       7000000    6300000.0
100214      John Norton      12000000   10800000.0

In [34]:
df_edit

                   name  gender   hire date  gross salary  nett salary
100111    Raven Bierman  Female  2016-12-04       7000000    6300000.0
100112    Valter Havers    Male  2018-04-13       7000000    6300000.0
200210    Marko Mendell    Male  2018-07-04      15000000   13500000.0
200211  Takahiro Momota    Male  2016-11-18      12000000   10800000.0
200312  Yahiko Tilemans    Male  2017-05-26      20000000   18000000.0
300207     Dina Rebaine  Female  2015-03-20      15000000   13500000.0
200115     Alicia Stark  Female  2020-05-29       7000000    6300000.0
100214      John Norton    Male  2020-05-29      12000000   10800000.0

In [35]:
df_edit.drop('nett salary', axis = 1, inplace = True)

> remove rows

In [36]:
df_edit.drop(100111, axis = 0)

                   name  gender   hire date  gross salary
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000
200115     Alicia Stark  Female  2020-05-29       7000000
100214      John Norton    Male  2020-05-29      12000000

In [37]:
df_edit.drop([200312,300207], axis = 0)

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200115     Alicia Stark  Female  2020-05-29       7000000
100214      John Norton    Male  2020-05-29      12000000

In [38]:
df_edit

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000
200115     Alicia Stark  Female  2020-05-29       7000000
100214      John Norton    Male  2020-05-29      12000000

In [39]:
df_edit.drop([200312,300207], axis = 0, inplace = True)

In [40]:
df_edit

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200115     Alicia Stark  Female  2020-05-29       7000000
100214      John Norton    Male  2020-05-29      12000000

# Renaming

> index

In [41]:
# 10-01-11
# dept-position-number

# series
emp_name = [
    'Raven Bierman',
    'Valter Havers',
    'Marko Mendell',
    'Takahiro Momota',
    'Yahiko Tilemans',
    'Dina Rebaine'
]
gender = ['Female','Male','Male','Male','Male','Female']
hire_date = [
    '2016-12-04',
    '2018-04-13',
    '2018-07-04',
    '2016-11-18',
    '2017-05-26',
    '2015-03-20'
]
salary = [7000000,7000000,15000000,12000000,20000000,15000000]

# dictionary
dict_emp = {
    'name':emp_name,
    'gender':gender,
    'hire date':hire_date,
    'gross salary':salary
}

# dataframe
df = pd.DataFrame(dict_emp)

In [42]:
df

              name  gender   hire date  gross salary
0    Raven Bierman  Female  2016-12-04       7000000
1    Valter Havers    Male  2018-04-13       7000000
2    Marko Mendell    Male  2018-07-04      15000000
3  Takahiro Momota    Male  2016-11-18      12000000
4  Yahiko Tilemans    Male  2017-05-26      20000000
5     Dina Rebaine  Female  2015-03-20      15000000

In [43]:
emp_no = [100111,100112,200210,200211,200312,300207]

In [44]:
dept_no = ['10','10','20','20','20','30']
level = ['01','01','02','02','03','02']
emp_no = ['11','12','10','11','12','07']

hire_index = list(zip(dept_no, level, emp_no))
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [45]:
hire_index

MultiIndex(levels=[['10', '20', '30'], ['01', '02', '03'], ['07', '10', '11', '12']],
           codes=[[0, 0, 1, 1, 1, 2], [0, 0, 1, 1, 2, 1], [2, 3, 1, 2, 3, 0]])

In [46]:
# 10-01-11
# dept-position-number

# series
emp_name = [
    'Raven Bierman',
    'Valter Havers',
    'Marko Mendell',
    'Takahiro Momota',
    'Yahiko Tilemans',
    'Dina Rebaine'
]
gender = ['Female','Male','Male','Male','Male','Female']
hire_date = [
    '2016-12-04',
    '2018-04-13',
    '2018-07-04',
    '2016-11-18',
    '2017-05-26',
    '2015-03-20'
]
salary = [7000000,7000000,15000000,12000000,20000000,15000000]

# dictionary
dict_emp = {
    'name':emp_name,
    'gender':gender,
    'hire date':hire_date,
    'gross salary':salary
}

# dataframe
df = pd.DataFrame(dict_emp, index = hire_index)

In [47]:
df

                     name  gender   hire date  gross salary
10 01 11    Raven Bierman  Female  2016-12-04       7000000
      12    Valter Havers    Male  2018-04-13       7000000
20 02 10    Marko Mendell    Male  2018-07-04      15000000
      11  Takahiro Momota    Male  2016-11-18      12000000
   03 12  Yahiko Tilemans    Male  2017-05-26      20000000
30 02 07     Dina Rebaine  Female  2015-03-20      15000000

In [48]:
dept_no = ['Data','Data','HR','HR','HR','Engineering']
level = ['staff','staff','manager','manager','geral manager','manager']
emp_no = ['11','12','10','11','12','07']

hire_index = list(zip(dept_no, level, emp_no))
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [49]:
hire_index

MultiIndex(levels=[['Data', 'Engineering', 'HR'], ['geral manager', 'manager', 'staff'], ['07', '10', '11', '12']],
           codes=[[0, 0, 2, 2, 2, 1], [2, 2, 1, 1, 0, 1], [2, 3, 1, 2, 3, 0]])

In [50]:
# 10-01-11
# dept-position-number

# series
emp_name = [
    'Raven Bierman',
    'Valter Havers',
    'Marko Mendell',
    'Takahiro Momota',
    'Yahiko Tilemans',
    'Dina Rebaine'
]
gender = ['Female','Male','Male','Male','Male','Female']
hire_date = [
    '2016-12-04',
    '2018-04-13',
    '2018-07-04',
    '2016-11-18',
    '2017-05-26',
    '2015-03-20'
]
salary = [7000000,7000000,15000000,12000000,20000000,15000000]

# dictionary
dict_emp = {
    'name':emp_name,
    'gender':gender,
    'hire date':hire_date,
    'gross salary':salary
}

# dataframe
df = pd.DataFrame(dict_emp, index = hire_index)

In [51]:
df

                                         name  gender   hire date  \
Data        staff         11    Raven Bierman  Female  2016-12-04
                          12    Valter Havers    Male  2018-04-13
HR          manager       10    Marko Mendell    Male  2018-07-04
                          11  Takahiro Momota    Male  2016-11-18
            geral manager 12  Yahiko Tilemans    Male  2017-05-26
Engineering manager       07     Dina Rebaine  Female  2015-03-20

                              gross salary
Data        staff         11       7000000
                          12       7000000
HR          manager       10      15000000
                          11      12000000
            geral manager 12      20000000
Engineering manager       07      15000000

> columns

In [52]:
df.columns

Index(['name', 'gender', 'hire date', 'gross salary'], dtype='object')

In [53]:
df.columns = ['name', 'gender', 'hire_date', 'gross_salary']

# Sorting

In [54]:
# 10-01-11
# dept-position-number

# series
emp_id = [100111,100112,200210,200211,200312,300207]
emp_name = [
    'Raven Bierman',
    'Valter Havers',
    'Marko Mendell',
    'Takahiro Momota',
    'Yahiko Tilemans',
    'Dina Rebaine'
]
gender = ['Female','Male','Male','Male','Male','Female']
hire_date = [
    '2016-12-04',
    '2018-04-13',
    '2018-07-04',
    '2016-11-18',
    '2017-05-26',
    '2015-03-20'
]
salary = [7000000,7000000,15000000,12000000,20000000,15000000]

# dictionary
dict_emp = {
    'name':emp_name,
    'gender':gender,
    'hire date':hire_date,
    'gross salary':salary
}

# dataframe
df = pd.DataFrame(dict_emp, index = emp_id)

> rows

In [55]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [56]:
df.sort_index()

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [57]:
df.sort_index(inplace=True)

In [58]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [59]:
df.sort_values('name')

                   name  gender   hire date  gross salary
300207     Dina Rebaine  Female  2015-03-20      15000000
200210    Marko Mendell    Male  2018-07-04      15000000
100111    Raven Bierman  Female  2016-12-04       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100112    Valter Havers    Male  2018-04-13       7000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000

In [60]:
df.sort_values('name',ascending = False)

                   name  gender   hire date  gross salary
200312  Yahiko Tilemans    Male  2017-05-26      20000000
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100111    Raven Bierman  Female  2016-12-04       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [61]:
df.sort_values('name',ascending = False,inplace=True)

In [62]:
df

                   name  gender   hire date  gross salary
200312  Yahiko Tilemans    Male  2017-05-26      20000000
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100111    Raven Bierman  Female  2016-12-04       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [63]:
df.sort_values(by = ['gender','name'])

                   name  gender   hire date  gross salary
300207     Dina Rebaine  Female  2015-03-20      15000000
100111    Raven Bierman  Female  2016-12-04       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100112    Valter Havers    Male  2018-04-13       7000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000

In [64]:
df.sort_values(by = ['gender','name'],
    ascending = [False,False])

                   name  gender   hire date  gross salary
200312  Yahiko Tilemans    Male  2017-05-26      20000000
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200210    Marko Mendell    Male  2018-07-04      15000000
100111    Raven Bierman  Female  2016-12-04       7000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [65]:
df.sort_values(
    by = ['gender','name'],
    ascending = [False,False],
    inplace = True
)

In [66]:
df

                   name  gender   hire date  gross salary
200312  Yahiko Tilemans    Male  2017-05-26      20000000
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200210    Marko Mendell    Male  2018-07-04      15000000
100111    Raven Bierman  Female  2016-12-04       7000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [67]:
df.sort_values(by = ['gender','name'],ascending = [True,False])

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
300207     Dina Rebaine  Female  2015-03-20      15000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
100112    Valter Havers    Male  2018-04-13       7000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200210    Marko Mendell    Male  2018-07-04      15000000

In [68]:
df.sort_values(by = ['gender','name'],ascending = [False,True])

                   name  gender   hire date  gross salary
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100112    Valter Havers    Male  2018-04-13       7000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000
100111    Raven Bierman  Female  2016-12-04       7000000

In [69]:
df.sort_values(by = ['gender','name'],ascending = [True,True])

                   name  gender   hire date  gross salary
300207     Dina Rebaine  Female  2015-03-20      15000000
100111    Raven Bierman  Female  2016-12-04       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
100112    Valter Havers    Male  2018-04-13       7000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000